a
ability
about
abstract
accuracy
accurately
activities
advanced
adverse
after
agree
ai
aim
algorithms
alone
also
amounts
an
analysis
and
anger
anticipated
applications
approaches
articles
artificial
as
aspects
at
attributes
automated
automatic
away
balances
based
bases
basic
between
beyond
both
brought
building
but
by
called
can
cannot
capabilities
capacity
capture
captures
cases
categories
ceiling
classification
classifies
clinical
clustering
cognitive
combine
combining
common
complex
complexity
compression
computational
computer
computers
computing
connects
context
criticize
cultural
cumulative
customer
data
datasets
deep
degree
demonstrated
despite
developing
development
dialogue
differ
differs
dimensionality
discourse
discovers
disgust
distinct
distinction
distinguishing
divides
document
domains
dominate
driven
drug
earlier
early
easily
effectively
eighties
eighty
elimination
embeddings
emerged
emotion
emotional
emphasize
encompasses
end-to-end
environments
eras:
errors
examine
examines
example
examples
excel
excellent
excessively
exist:
experience
experienced
explicit
expressed
expresses
expression
facts
factual
favor
feature
field
fifties
focused
focusing
food
for
forecasting
foundational
from
fundamental
general
generalization
generalize
generation
goals:
good
grammar
grown
hand-coded
handle
handling
has
have
healthcare
helps
historical
hotel
however
human
humans
hybrid
identifies
identify
identifying
implicit
important
improve
improved
improving
in
inception
include
included
increased
increasingly
inferences
information
inherited
inputs
instance
intelligence
interaction
interpretation
intertwined
into
involves
is
it
it's
its
jokes
judgment
knowledge
knowledge-based
labeled
language
languages
larger
late
learn
learning
levels
leverage
like
limited
location
low-resource
machine
machines
main
major
makes
management
managing
mappings
marketing
maximize
measures
media
methods
might
mining
misinterpret
misses
model
models
monitoring
morphological
multilingual
natural
negations
negative
network
network-based
networks
neural
neutral
new
news
nineteen
nineties
now
nuances
objective
of
often
on
one
ones
only
onward
opinion
opinion-based
optimization
or
other
outputs
overall
overfit
overlaps
overly
own
parsing
particularly
patterns
peak
percent
performance
performing
personal
platform-specific
polarity
political
population
positive
practical
praise
predefined
predictions
predictive
preprocessing
presents
principal
probability
processing
programming
progress
proved
proves
quality
question-answering
range
raters
reactions
recent
recognition
recommendation
reducing
reduction
reinforcement
reliably
remains
replaced
representations
represented
requiring
research
retain
review
reviews
rewards
rule-based
rules
sarcasm
scaling
science
semantic
semi-supervised
sentence
sentiment
sentiments
service
setting
shift
shifting
significantly
simple
since
situations
slower
small
social
specific
speech
statements
states
statistical
statistics
structures
struggles
study
subfield
subjective
substantially
supervised
support
supports
surprise
symbolic
syntactic
systems
task
tasks
techniques
text
than
that
the
theory
these
this
though
three
through
time
to
toward
traditional
traditionally
training
trains
translation
trends
two
typically
underfit
understanding
unfamiliar
unlabeled
unseen
unsupervised
used
user
uses
using
utility
valuable
verification
via
vocabularies
was
while
widely
with
within
without
word
wordplay
words
work
[UNK]
